RSS/lighter-view-controllers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lighter View Controller</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Lighter View Controller"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-08 11:40:40 CST"/>
<meta name="author" content="Yifeng Li"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Lighter View Controller</h1>

<p>原文:<a href="http://www.objc.io/issue-1/lighter-view-controllers.html">http://www.objc.io/issue-1/lighter-view-controllers.html</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 分离data source和其他protocols</a></li>
<li><a href="#sec-2">2 将业务逻辑移动至Model层</a></li>
<li><a href="#sec-3">3 创建Store类，专注于数据的加载、缓存，以及对数据库进行配置，用作service layer</a></li>
<li><a href="#sec-4">4 web service逻辑移动至Model层</a></li>
<li><a href="#sec-5">5 将view代码移动至View层</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 分离data source和其他protocols</h2>
<div class="outline-text-2" id="text-1">




<pre class="src src-C">@implementation ArrayDataSource
- (<span style="color: #228b22;">id</span>)itemAtIndexPath:(<span style="color: #228b22;">NSIndexPath</span>*)indexPath {
  <span style="color: #a020f0;">return</span> items[(<span style="color: #228b22;">NSUInteger</span>)indexPath.row];
}
- (<span style="color: #228b22;">NSInteger</span>)tableView:(<span style="color: #228b22;">UITableView</span>*)<span style="color: #228b22;">tableView</span>
 <span style="color: #0000ff;">numberOfRowsInSection</span>:(<span style="color: #228b22;">NSInteger</span>)section {
  <span style="color: #a020f0;">return</span> items.count;
}

- (<span style="color: #228b22;">UITableViewCell</span>*)tableView:(<span style="color: #228b22;">UITableView</span>*)<span style="color: #228b22;">tableView</span>
        <span style="color: #0000ff;">cellForRowAtIndexPath</span>:(<span style="color: #228b22;">NSIndexPath</span>*)indexPath {
  <span style="color: #228b22;">id</span> <span style="color: #a0522d;">cell</span> = [tableView dequeueReusableCellWithIdentifier:cellIdentifier
                                            forIndexPath:indexPath];
  <span style="color: #228b22;">id</span> <span style="color: #a0522d;">item</span> = [self itemAtIndexPath:indexPath];
  configureCellBlock(cell,item);
  <span style="color: #a020f0;">return</span> cell;
}
@end

<span style="color: #228b22;">void</span> (^configureCell)(<span style="color: #228b22;">PhotoCell</span>*, <span style="color: #228b22;">Photo</span>*) = ^(PhotoCell* cell, Photo* photo) {
  cell.label.text = photo.name;
};
photosArrayDataSource = [[ArrayDataSource alloc] initWithItems:photos
                                                cellIdentifier:PhotoCellIdentifier
                                            configureCellBlock:configureCell];
self.tableView.dataSource = photosArrayDataSource;
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 将业务逻辑移动至Model层</h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 创建Store类，专注于数据的加载、缓存，以及对数据库进行配置，用作service layer</h2>
<div class="outline-text-2" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> web service逻辑移动至Model层</h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 将view代码移动至View层</h2>
<div class="outline-text-2" id="text-5">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-07-08 11:40:40 CST</p>
<p class="author">Author: Yifeng Li</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
